# Config
cask_args appdir: '~/Applications'

# Taps
tap 'homebrew/cask'

# Packages
brew 'git'
brew 'bash-completion'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gawk'
brew 'grep'
brew 'bash'
brew 'bash-completion2'
brew 'htop'
brew 'git'
brew 'p7zip'
brew 'ssh-copy-id'
brew 'unison'
brew 'pv'
brew 'ag'

# Casks
cask 'iterm2'
cask 'atom'
cask 'cyberduck'
cask 'macdown'
cask 'mysqlworkbench'
cask 'postman'
cask 'skim'
cask 'sequel-pro'
cask 'visual-studio-code'
