# Usage:   brew bundle

# Config
cask_args appdir: '~/Applications'

# Taps
tap 'homebrew/cask'

# Packages
brew 'git'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gawk'
brew 'grep'
brew 'bash'
brew 'zsh'
brew 'htop'
brew 'p7zip'
brew 'ssh-copy-id'
brew 'unison'
brew 'pv'
brew 'ag'
brew 'ansible'
brew 'packer'
brew 'terraform'
brew 'tmux'
brew 'awscli'

# Casks
cask 'firefox'
cask 'chromium'
cask 'iterm2'
cask 'atom'
cask 'cyberduck'
cask 'macdown'
cask 'mysqlworkbench'
cask 'postman'
cask 'skim'
cask 'sequel-pro'
cask 'visual-studio-code'
cask 'vagrant'

# completion
brew 'bash-completion@2'
brew 'packer-completion'
brew 'vagrant-completion'
brew 'docker-completion'
brew 'docker-compose-completion'
brew 'brew-cask-completion'
brew 'maven-completion'
brew 'tmuxinator-completion'
brew 'yarn-completion'
brew 'zsh-completions'
